<template>
  <div>
    <h3>我的随笔</h3>
    <p>
      随着互联网技术的持续发展与广泛应用，博客已经成为了现代必不可少的信息传播手段，对人类的信息传播与交流具有重要意义。博客是潮流的象征，它的出现，掀起了一阵热潮，惹人注目。博客能发展至今，更多的是它方便了个人情感的表达，拉近了人与人之间的距离，促进了彼此之间的交流。实际上，每个人都在阅读博客，形式各异的博客已经成为了网络文化不可分割的一部分。个人博客管理系统是主要使用Spring
      Boot和Vue.js技术搭建的个人信息交流平台，访客可以浏览文章、评论文章或者向博主留言等；博主可以发表文章、留言回复等。
    </p>
    <p>
      个人博客管理系统的用户角色分为博主和访客两种，博主通发布文章来进行信息共享，访客通过阅读文章、评论、留言的方式与他人进行交流，这就体现了博客的价值所在。博主拥有整个系统的最高权限，系统后台只对博主开放，博主可以对文章进行分门别类，更有利于文章的查阅和管理。访客通过IP地址访问本站，阅读博文，如此便实现了信息共享。访客可以在文章底部对文章进行评论，也可以在留言板上给博主留言，博主查看文章评论或留言板上的访客留言，对其进行回复，做到了信息交流。
    </p>
    <p>
      通过完成个人博客管理系统的设计与实现，对Spring
      Boot、Vue.js等技术的掌握更加熟练。在完成过程中，从需求分析、概要设计、详细设计到实现与应用，对软件工程要求的软件开发流程有了进一步的了解。个人博客管理系统已经不是一个新奇的事物，但是，通过本次的设计与实现，它成为了我的个人网站，可以与他人共享、交流知识。
    </p>
    <p>
      在如今的互联网时代，博客已然成为网民们的个人信息发布中心，每个人都可以共享与交流自己的感想和领悟。博客已经从2006年的突飞猛进归为平淡，不知不觉地融入到我们的生活中，成为了表达自我的主要方式。互联网上高达77%左右的用户经常阅读博客。2020年，仅美国的博客用户数量就达到了3170万左右。截至2021年，基于WordPress、Tumblr、Blogger、Wix、Squarespace和媒体的活动报道，互联网上有超过5.7亿个博客(这个数字还在不断增长)。目前国内的博客人群规模达到亿人，博客的未来将朝着更加规范化、专业化、平民化的方向而努力。
    </p>
  </div>
</template>
<script>
export default {};
</script>

<style scoped>
p {
  text-indent: 2em;
  font-size: 14px;
  line-height: 25px;
  letter-spacing: 1px;
}
</style>
